tiborsimon/embedded-tdd-headers/pic/pic16/pic16c715_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C715_H_
#define _PIC16C715_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define PORTB                         18
#define RB0                           19
#define RB1                           20
#define RB2                           21
#define RB3                           22
#define RB4                           23
#define RB5                           24
#define RB6                           25
#define RB7                           26
#define INTCON                        27
#define RBIF                          28
#define INTF                          29
#define T0IF                          30
#define TMR0IF                        31
#define RBIE                          32
#define INTE                          33
#define T0IE                          34
#define TMR0IE                        35
#define PEIE                          36
#define GIE                           37
#define PIR1                          38
#define ADIF                          39
#define ADCON0                        40
#define ADON                          41
#define nDONE                         42
#define GO_nDONE                      43
#define GO_DONE                       44
#define GO                            45
#define CHS                           46
#define CHS0                          47
#define CHS1                          48
#define CHS2                          49
#define ADCS                          50
#define ADCS0                         51
#define ADCS1                         52
#define OPTION_REG                    53
#define PS0                           54
#define PS1                           55
#define PS2                           56
#define PSA                           57
#define T0SE                          58
#define T0CS                          59
#define INTEDG                        60
#define nRBPU                         61
#define TRISA                         62
#define TRISA0                        63
#define TRISA1                        64
#define TRISA2                        65
#define TRISA3                        66
#define TRISA4                        67
#define TRISB                         68
#define TRISB0                        69
#define TRISB1                        70
#define TRISB2                        71
#define TRISB3                        72
#define TRISB4                        73
#define TRISB5                        74
#define TRISB6                        75
#define TRISB7                        76
#define PIE1                          77
#define ADIE                          78
#define PCON                          79
#define nBOR                          80
#define nBO                           81
#define nPOR                          82
#define nMPE                          83
#define nPER                          84
#define MPEEN                         85
#define ADCON1                        86
#define PCFG0                         87
#define PCFG                          88
#define PCFG1                         89

#endif // _PIC16C715_H_
